In [2]:
import pandas as pd
data={
    'first name':['aryan','rohan','riye','yash','sidhanth'],
    'last name':['singh','agrwal','sh','gh','p'],
    'type':['full-time employee','interm','full-time employee','part- time employee','full-time employee'],
    'department':['administration','technical','administation','technical','mangement'],
    'yoE':[2,3,6,7,6],
     'salary':[20000,5000,10000,10000,20000]
    }
df=pd.DataFrame(data)
print(df)

  first name last name                 type      department  yoE  salary
0      aryan     singh   full-time employee  administration    2   20000
1      rohan    agrwal               interm       technical    3    5000
2       riye        sh   full-time employee   administation    6   10000
3       yash        gh  part- time employee       technical    7   10000
4   sidhanth         p   full-time employee       mangement    6   20000

In [17]:
table=pd.pivot_table(df,index=['type','department'],
                     values='salary',aggfunc='mean')
table

                                    salary
type                department
full-time employee  administation    10000
                    administration   20000
                    mangement        20000
interm              technical         5000
part- time employee technical        10000

In [23]:
pivot=pd.pivot_table(
data=df,
index='type',
values='salary',
aggfunc=['mean','sum'])
print(pivot)

                             mean    sum
                           salary salary
type
full-time employee   16666.666667  50000
interm                5000.000000   5000
part- time employee  10000.000000  10000

In [20]:
|

SyntaxError: invalid syntax (525519296.py, line 1)